{
	"Menu": {
		"home": "Home",
		"skills": "Skills",
		"projects": "Projects",
		"experiences": "Experiences",
		"contact": "Contact"
	},

	"Home": {
		"welcome-im-devobot": "Welcome, I'm Devobot!",
		"i-will-be-your-guide": "I'll be your guide on this journey through Robin's world! But who is he?",
		"job": "Job",
		"fullstack-developper": "Fullstack Developper",
		"experience": "Experience",
		"year": "years",
		"see-his-skills": "See his skills",
		"number-of-projects": "Number of projects completed",
		"see-his-github": "See his github",
		"download-cv": "Download Robin's CV",
		"know-more": "Would you like to get to know him a little better?",
		"know-more-description": "I took the liberty of asking Robin a few questions straight away. Let's find out who's behind this portfolio!",
		"see-answer": "See the answer",
		"question-1": "What type of career opportunity are you looking for?",
		"answer-1": "I'm looking for a job as a front-end or fullstack developer (React/NextJs/Typescript/Symfony). But I'm open to other technologies (Angular/VueJs/NodeJS) if I'm offered the opportunity to train in them!",
		"question-2": "Okay top! And if you had a choice of several opportunities, what criteria would you use to make your choice?",
		"answer-2": "My first criterion is the type of project! I'm looking for a big, challenging project to push my limits and grow! (My portfolio is a nod to SaaS projects). And if there's the possibility of working/evolving full-time or part-time 4 days a week for me, that's the jackpot!",
		"question-3": "Very good, we can see that you know what you want! Do you have any hobbies outside work?",
		"answer-3": "Yes! I love sport and do it almost every day! I go back and forth between tai chi, basketball, competitive volleyball, rollerblading and surfing (which is actually what motivated me to come to Bordeaux)!",
		"question-4": "Top! Do you have a special or unusual talent that you'd like to share with us?",
		"answer-4": "It might sound counter-intuitive for a developer, but I'm an energeticist and a musician! I like the very logical, down-to-earth side of web development, but I also like human contact and sharing my creativity! It's this combination that allows me to express who I am and finally find a balance in my life!",
		"question-5": "Really interesting! And finally: Star Wars or Lord of the Rings?",
		"answer-5": "Lord of the Rings without hesitation! ‘I can read in your eyes the same fear that could seize my heart. A day may come when the courage of men fails and we abandon our friends. But that day has not come!’ Chills guaranteed ahah!"
	},

	"SkillsPage": {
		"programming-languages-expertise": "Programming Languages Expertise",
		"frameworks-expertise": "Frameworks Expertise",
		"tools-expertise": "Tools Expertise",
		"creativity": "Creativity",
		"creativity-description": "It's thanks to music that he's been able to develop and trust his creativity!",
		"curiosity": "Curiosity",
		"curiosity-description": "He developed his curiosity out of a desire to understand the world and others!",
		"stress-management": "Stress management",
		"stress-management-description": "Thanks to meditation and his ability to take a step back from a situation, he has developed his ability to manage stress.",
		"humility": "Humility",
		"humility-description": "It was through sport that he realized that there will always be someone better than him, and that humility was the way to accept and see himself as he is.",
		"communication": "Communication",
		"communication-description": "By working with many different trades, he was able to understand the impact of good communication on the smooth running of a project.",
		"autonomy": "Autonomy",
		"autonomy-description": "In his previous company, he didn't have a more experienced front-end developer than himself, so he had to develop his autonomy in order to find solutions to the problems he encountered.",
		"his-skills": "His skills",
		"hey-im-devobot": "Hi, it's Devobot !",
		"check-his-skills": "Is your visit going well? I can see that you like things concrete, so let's take a look at his technical skills together!",
		"his-soft-skills": "His soft skills",
		"check-his-soft-skills1": "Technical skills are great!",
		"check-his-soft-skills2": "But who's the human behind it all? As a robot, I'm curious, aren't you?"
	},

	"ProjectsPage": {
		"his-projects": "His projects",
		"its-me-again": "Hi, it's me again, Devobot!",
		"check-his-projects": "Here you'll find the projects he's been working on. But being a perfectionist, he's only taking on one for the moment !",
		"roots-of-healing": "The roots of healing",
		"discover": "Discover"
	},

	"ExperiencesPage": {
		"his-experiences": "His experiences",
		"front-end-developper": "Front-End Developper",
		"fullstack-developper": "Fullstack Developper",
		"fullstack-web-developper": "Fullstack Web Developper",
		"junior-web-developper": "Junior Web Developper",
		"july2023-to-today": "July 2023 to Today",
		"february2021-to-july2023": "February 2021 to July 2023",
		"december2020-to-december2021": "December 2020 to December 2021",
		"january2019-to-july2020": "January 2019 to July 2020",
		"self-employed-contractor": "Self-Employed contractor",
		"front-end-developper-experience": "He developed his own business in energy healing and therapeutic music. He trained himself and created his own website with NextJS to make it modern, intuitive and efficient for users.",
		"fullstack-developper-experience": "He started out as an alternating front-end developer (Twig, JS, jQuery, SCSS), then moved on to a permanent contract as a fullstack developer (React/Typescript and Symfony).",
		"fullstack-web-developper-experience": "He strengthened his knowledge of Symfony, then learned React and used it to redesign the software of the company where he was a work-study student.",
		"junior-web-developper-experience": "He created 5 website projects during his online training. Mock-up integration, creation of a Wordpress site, creation of a dynamic site in JS with API integration, creation of a blog in PHP and JS, then a redesign of a basketball club site in Symfony.",
		"its-devobot-again": "Hey, it's me again, Devobot!",
		"career-path": "Click here to find out more about her background, including her professional experience and training!"
	},

	"ExperiencesCard": {
		"duration": "Duration",
		"company": "Company",
		"formation": "Formation",
		"read-more": "Read more"
	},

	"ContactPage": {
		"contact-form": "Contact form",
		"hi-its-devobot": "Hi, its Devobot again !",
		"contact-him": "Does his world appeal to you and do you have an opportunity that matches his profile? Then send him a message!",
		"your-message": "Your message",
		"your-message-placeholder": "Example : I have an opportunity for you",
		"your-firstname": "Your firstname",
		"your-firstname-placeholder": "Example : Dave",
		"your-lastname": "Your lastname",
		"your-lastname-placeholder": "Example : Loppeleur",
		"your-email": "Your email",
		"your-email-placeholder": "Example : dave.loppeleur@gmail.com",
		"send": "Send",
		"success": "Success",
		"success-message": "Thank you for your time! Your message has been sent, Robin will get back to you as soon as possible.",
		"error": "Error",
		"error-message": "An error has occurred while sending your message. Please do not hesitate to contact Robin directly by email. You'll find his email address at the bottom of the page."
	},

	"LegalNotices": {
		"legal-notices": "Legal notices",
		"its-devobot-again": "Hi, it's me again, Devobot!",
		"legal-notices-description": "We would like to provide you with transparent information about the legal aspects of his site. Please take a moment to read the following information.",
		"site-manager": "Site manager",
		"manager-name": "Manager name",
		"address": "Address",
		"email-address": "Email address",
		"hosting": "Hosting",
		"site-hosted-by": "This site is hosted by",
		"host-address": "Host address",
		"intellectual-property": "Intellectual property",
		"intellectual-property-description": "The content of this site, including texts, images, videos and other elements, is protected by intellectual property laws. All rights are reserved. You are not authorized to reproduce, distribute or use the content of this site without his written authorization.",
		"data-collection": "Collection of personal data",
		"data-collection-description": "When you visit his site, it may collect certain personal information in accordance with the data protection policy. For more information on the collection and use of your personal data, please refer to this page",
		"data-protection": "data protection",
		"responsibility": "Responsibility",
		"responsibility-description": "He does his best to provide accurate and up-to-date information on this site. However, it cannot guarantee the accuracy, relevance or completeness of this information. As a visitor, you are responsible for your use of the information presented on this site.",
		"external-links": "External links",
		"external-links-description": "This site may contain links to external websites. he is not responsible for the content or privacy practices of such sites, and I encourage you to consult their own privacy policies and legal notices.",
		"contact-description": "If you have any questions about these legal notices or the site in general, please do not hesitate to contact him at the following e-mail address: poncon.robin@gmail.com or directly at",
		"contact-form": "contact form"
	},

	"DataProtectionPage": {
		"data-protection": "Data protection",
		"its-devobot-again": "Salut, c'est encore moi, Devobot !",
		"welcome-data-protection": "Welcome to the data protection page. I would like to assure you that Robin takes the privacy and security of your personal information very seriously. The purpose of this privacy policy is to inform you about how Robin collects, uses, shares and protects your data.",
		"collecting-data": "Collection of your personal data",
		"when-you-visit": "When you visit its website, it may collect certain personal information, including :",
		"identification-information": "- Identification information",
		"identification-information-description": ": Your last name, first name, e-mail address and any other contact details you choose to provide via the contact form.",
		"navigation-data": "- Navigation data",
		"navigation-data-description": ": Information collected automatically when you visit our site, such as your IP address, the type of browser you use, the pages you visit and how you interact with our site.",
		"use-your-data": "Use of your personal data",
		"use-your-data-for": "He uses the personal data collected for the following purposes :",
		"answering-your-request": "- Responding to your requests",
		"answering-your-request-description": ": If you contact him via his contact form, he uses your information to answer your questions or requests.",
		"improving-his-website": "- Improving his website",
		"improving-his-website-description": ": He may use browsing data to understand how visitors use its website and improve it accordingly.",
		"sharing-your-data": "Sharing your data",
		"sharing-your-data-description": "He doesn't share your personal data with third parties, except in the following cases:",
		"legal-obligations": "- Legal obligations",
		"legal-obligations-description": ": He may be required to disclose your information if required by law.",
		"data-security": "Data security",
		"data-security-description": "He takes appropriate security measures to protect your personal data against loss, unauthorized access, disclosure, alteration or destruction. However, no method of transmission over the Internet or method of electronic storage is completely secure, and he cannot guarantee the absolute security of your data.",
		"your-rights": "Your rights",
		"your-rights-description": "You have the right to access, rectify, delete, object to or request the portability of your personal data. To exercise these rights, or if you have any questions about our data protection policy, please contact us using the contact details provided on our website.",
		"policy-changes": "Policy changes",
		"policy-changes-description": "He reserves the right to update this data protection policy at any time to reflect changes in its practices or legal requirements. I encourage you to visit this page regularly to stay informed about how he protects your data."
	},

	"Footer": {
		"home": "Home",
		"skills": "Skills",
		"projects": "Projects",
		"experiences": "Experiences",
		"contact": "Contact",
		"legal-notices": "Legal notices",
		"data-protection": "Data protection",
		"about": "ABOUT",
		"download-cv": "Download CV",
		"all-rights-reserved": "All rights reserved"
	},

	"NotFoundPage": {
		"not-found": "Page not found !",
		"hey-im-devobot": "Hi, it's Devobot !",
		"you-are-lost": "It seems you've lost your way in a parallel universe! Click on the button below to return to your previous destination.",
		"back": "Back Home"
	}
}
