{
	"Menu": {
		"home": "Accueil",
		"skills": "Compétences",
		"projects": "Projets",
		"experiences": "Expériences",
		"contact": "Contact"
	},

	"Home": {
		"welcome-im-devobot": "Bienvenue, je suis Devobot !",
		"i-will-be-your-guide": "Je serais votre guide durant ce voyage au travers de l'univers de Robin ! Mais qui est-il ?",
		"job": "Métier",
		"frontend-engineer": "Frontend Engineer",
		"experience": "Expérience",
		"year": "ans",
		"main-technos": "Technos principales",
		"see-his-skills": "Voir ses compétences",
		"number-of-projects": "Nombre de projets réalisés",
		"see-his-github": "Voir son github",
		"download-cv": "Télécharger le CV de Robin",
		"know-more": "Envie de le connaître un peu plus ?",
		"know-more-description": "Je me suis permis de poser directement quelques questions à Robin. Découvrons ensemble qui se cache derrière ce portfolio !",
		"see-answer": "Voir la réponse",
		"question-1": "Quel type d’opportunité professionnelle recherches-tu ?",
		"answer-1": "Je recherche une opportunité en tant que Frontend Engineer orienté produit et UX. J’aime travailler sur des produits web complexes, où le frontend ne se limite pas à l’intégration mais participe pleinement à la compréhension des besoins métier et à l’expérience utilisateur. Je souhaite collaborer étroitement avec les équipes produit et techniques pour construire des applications fiables, maintenables et agréables à utiliser, en m’appuyant notamment sur React, Next.js et TypeScript.",
		"question-2": "Okay top ! Et si tu avais le choix entre plusieurs opportunités, sur quels critères, ferais-tu ton choix ?",
		"answer-2": "Si j’avais le choix entre plusieurs opportunités, je porterais une attention particulière à la qualité du produit, à la collaboration entre les équipes produit, design et développement, ainsi qu’à la place accordée à la qualité du code et à la maintenabilité. Je serais également attentif à l’état d’esprit de l’équipe, à la clarté de la vision produit et à la capacité de l’entreprise à offrir un cadre de travail sain, propice à la progression sur le long terme.",
		"question-3": "Très bien, on voit que tu sais ce que tu veux ! As-tu des passions en dehors du travail ?",
		"answer-3": "Le sport fait partie intégrante de mon équilibre. J’en pratique presque quotidiennement, entre le tai-chi, le basket, le volley en compétition, le roller et le surf (une passion qui a d’ailleurs motivé mon choix de m’installer à Bordeaux).",
		"question-4": "Top ! As-tu un talent particulier ou insolite que tu voudrais nous partager ?",
		"answer-4": "Ça peut être contre intuitif pour un développeur, mais je suis énergéticien et musicien ! J’aime le côté très logique et terre-à-terre du développement web, mais j’aime aussi le contact humain et partager ma créativité ! C’est cet ensemble qui me permet d’exprimer qui je suis et de finalement trouver un équilibre dans ma vie !",
		"question-5": "Super intéressant ! Et pour finir : plutôt Star Wars ou Seigneur des anneaux ?",
		"answer-5": "Seigneur des anneaux sans hésiter ! « Je peux lire dans vos yeux la même peur qui pourrait saisir mon cœur. Un jour peut venir où le courage des hommes faillira où nous abandonnerons nos amis. Mais ce jour n'est pas arrivé ! » Frissons garantis ahah !"
	},

	"SkillsPage": {
		"programming-languages-expertise": "Expertise Langages de Programmation",
		"frameworks-expertise": "Expertise Frameworks",
		"tools-expertise": "Expertise Outils",
		"creativity": "Créativité",
		"creativity-description": "C'est grâce à la musique qu'il a pu développer et faire confiance à sa créativité !",
		"curiosity": "Curiosité",
		"curiosity-description": "C'est dans un désir de comprendre le monde et les autres qu'il a développé sa curiosité !",
		"stress-management": "Gestion du stress",
		"stress-management-description": "C'est grâce à la méditation et sa capacité à prendre du recul sur une situation qu'il a développé sa capacité à gérer son stress.",
		"humility": "Humilité",
		"humility-description": "C'est en faisant du sport qu'il s'est rendu compte qu'il y aura toujours quelqu'un de meilleur que lui, et que l'humilité était une solution pour qu'il s'accepte et se voit tel qu'il est.",
		"communication": "Communication",
		"communication-description": "C'est en travaillant avec de nombreux corps de métiers différents, qu'il a pu comprendre l'impact d'une bonne communication sur le bon déroulement d'un projet.",
		"autonomy": "Autonomie",
		"autonomy-description": "C'est dans son ancienne entreprise, n'ayant pas eu de développeur front-end plus expérimenté que lui, qu'il a du développé son autonomie afin de trouver des solutions aux problèmes rencontrés.",
		"his-skills": "Ses compétences",
		"hey-im-devobot": "Salut, c'est Devobot !",
		"check-his-skills": "Est-ce que votre visite se passe bien ? Je vois que vous aimez les choses concrètes, alors regardons ensemble ses compétences techniques !",
		"his-soft-skills": "Ses savoir-être",
		"check-his-soft-skills1": "Les compétences techniques c'est bien !",
		"check-his-soft-skills2": "Mais quel est l'humain derrière tout ça ? En tant que robot je suis curieux, pas vous ? Je vous invite à cliquer sur chaque savoir-être pour en savoir davantage sur Robin !"
	},

	"ProjectsPage": {
		"his-projects": "Ses projets",
		"its-me-again": "Salut c'est encore moi Devobot !",
		"check-his-projects": "Ici vous trouverez les projets qu'il a réalisé. Mais étant perfectioniste, il n'en assume qu'un pour le moment !",
		"roots-of-healing": "Les racines de la guérison",
		"discover": "Découvrir"
	},

	"ExperiencesPage": {
		"his-experiences": "Ses expériences",
		"fullstack-developper": "Frontend Engineer",
		"fullstack-web-developper": "Développeur Front-end junior",
		"junior-web-developper": "Développeur Web Junior",
		"july2023-to-today": "Juillet 2023 à Aujourd'hui",
		"february2021-to-july2023": "Février 2021 à Juillet 2023",
		"december2020-to-december2021": "Décembre 2020 à Décembre 2021",
		"january2019-to-july2020": "Janvier 2019 à Juillet 2020",
		"self-employed-contractor": "Auto-entrepreneur",
		"front-end-developper-experience": "Développement de projets web en React, Next.js et TypeScript, avec un focus sur la performance, le SEO et l’expérience utilisateur. Réalisation d’un portfolio et d’un site vitrine professionnel, intégration d’API tierces (Google Maps, Google Agenda), mise en place de fonctionnalités transverses (thème clair/sombre, i18n), et attention portée à la qualité et la maintenabilité du code frontend.",
		"fullstack-developper-experience": "Participation à la refonte d’une application SaaS reposant sur un backend Symfony, avec migration progressive vers un frontend moderne en React et TypeScript. Développement de fonctionnalités frontend from scratch à partir de maquettes Figma, avec une attention particulière portée à l’expérience utilisateur, à la gestion des cas limites et des états d’erreur. Intégration de fonctionnalités métier clés (formulaires dynamiques avec validation en temps réel, lecteur PDF pour l’automatisation de devis et factures) et collaboration étroite avec les équipes backend Symfony pour l’intégration des API et la cohérence fonctionnelle.",
		"fullstack-web-developper-experience": "Intégration de maquettes Figma dans une application SaaS en JavaScript, SCSS et Twig. Participation à la mise en place d’un système de traduction multilingue sous Symfony. Refactorisation de code JavaScript legacy, avec découpage d’un fichier monolithique en modules plus lisibles et maintenables.",
		"junior-web-developper-experience": "Formation professionnalisante avec réalisation de projets web concrets : intégration HTML/CSS responsive, site vitrine WordPress, application JavaScript (POO), blog PHP et refonte d’un site associatif sous Symfony.",
		"its-devobot-again": "Devobot, pour vous servir !",
		"career-path": "Ici vous trouverez son parcours comprenant ses expériences professionnelles ainsi que ses formations !"
	},

	"ExperiencesCard": {
		"duration": "Durée",
		"company": "Entreprise",
		"formation": "Formation",
		"read-more": "En savoir plus"
	},

	"ContactPage": {
		"contact-form": "Formulaire de contact",
		"hi-its-devobot": "Et oui, c'est encore moi, Devobot !",
		"contact-him": "Son univers vous fait vibrer et vous avez une opportunité qui correspond à son profil ? Alors n'hésitez plus, envoyer lui un message !",
		"your-message": "Votre message",
		"your-message-placeholder": "Exemple : J'ai une opportunité à vous proposer",
		"your-firstname": "Votre prénom",
		"your-firstname-placeholder": "Exemple : Dave",
		"your-lastname": "Votre nom",
		"your-lastname-placeholder": "Exemple : Loppeleur",
		"your-email": "Votre email",
		"your-email-placeholder": "Exemple : dave.loppeleur@gmail.com",
		"send": "Envoyer",
		"success": "Succès",
		"success-message": "Merci ! Votre message a bien été envoyé, Robin vous fera un retour rapidement.",
		"error": "Erreur",
		"error-message": "Une erreur est survenue durant l'envoi de votre message, n'hésitez pas à contacter Robin directement par email. Vous trouverez son email en bas de la page."
	},

	"LegalNotices": {
		"legal-notices": "Mentions légales",
		"its-devobot-again": "Hey, c'est encore moi, Devobot !",
		"legal-notices-description": "Il tient à vous informer de manière transparente sur les aspects juridiques de son site. Veuillez prendre quelques instants pour lire les informations suivantes.",
		"site-manager": "Responsable du site",
		"manager-name": "Nom du responsable",
		"address": "Adresse",
		"email-address": "Adresse email",
		"hosting": "Hébergement",
		"site-hosted-by": "Ce site est hébergé par",
		"host-address": "Adresse de l'hébergeur",
		"intellectual-property": "Propriété intellectuelle",
		"intellectual-property-description": "Le contenu de ce site, y compris textes, images, vidéos, et autres éléments, est protégé par les lois sur la propriété intellectuelle. Tous les droits sont réservés. Vous n'êtes pas autorisé à reproduire, distribuer ou utiliser le contenu de ce site sans son autorisation écrite.",
		"data-collection": "Collecte de données personnelles",
		"data-collection-description": "Lorsque vous visitez son site, il peut collecter certaines informations personnelles conformément à la politique de protection des données. Pour plus d'informations sur la collecte et l'utilisation de vos données personnelles, veuillez vous référer à cette page",
		"data-protection": "protection des données",
		"responsibility": "Responsabilité",
		"responsibility-description": "Il fait de mon mieux pour fournir des informations précises et à jour sur ce site. Cependant, il ne peut garantir l'exactitude, la pertinence ou l'exhaustivité de ces informations. En tant que visiteur, vous êtes responsable de l'utilisation que vous faites des informations présentées sur ce site.",
		"external-links": "Liens externes",
		"external-links-description": "Ce site peut contenir des liens vers des sites web externes. Il n'est pas responsable du contenu ou des pratiques de confidentialité de ces sites, et je vous encourage à consulter leurs propres politiques de confidentialité et mentions légales.",
		"contact-description": "Si vous avez des questions concernant ces mentions légales ou le site en général, n'hésitez pas à le contacter à l'adresse email suivante : poncon.robin@gmail.com ou directement par le",
		"contact-form": "formulaire de contact"
	},

	"DataProtectionPage": {
		"data-protection": "Protection des données",
		"its-devobot-again": "Hey, c'est encore moi, Devobot !",
		"welcome-data-protection": "Bienvenue sur la page dédiée à la protection de vos données. Je tiens à vous assurer que Robin prend très au sérieux la confidentialité et la sécurité de vos informations personnelles. Cette politique de protection des données a pour but de vous informer sur la manière dont il collecte, utilise, partage et protège vos données.",
		"collecting-data": "Collecte de vos données personnelles",
		"when-you-visit": "Lorsque vous visitez son site web, il peut collecter certaines informations personnelles, notamment :",
		"identification-information": "- Informations d'identification",
		"identification-information-description": ": Votre nom, votre prénom, votre adresse email et éventuellement d'autres coordonnées que vous choisissez de lui fournir via le formulaire de contact.",
		"navigation-data": "- Données de navigation",
		"navigation-data-description": ": Les informations recueillies automatiquement lorsque vous visitez son site, telles que votre adresse IP, le type de navigateur que vous utilisez, les pages que vous consultez et la manière dont vous interagissez avec son site.",
		"use-your-data": "Utilisation de vos données personnelles",
		"use-your-data-for": "Il utilise les données personnelles collectées pour les finalités suivantes :",
		"answering-your-request": "- Répondre à vos demandes",
		"answering-your-request-description": ": Si vous le contactez via son formulaire de contact, il utilise vos informations pour répondre à vos questions ou demandes.",
		"improving-his-website": "- Amélioration de son site",
		"improving-his-website-description": ": Il peut utiliser les données de navigation pour comprendre comment les visiteurs utilisent son site et ainsi l'améliorer en conséquence.",
		"sharing-your-data": "Partage de vos données",
		"sharing-your-data-description": "Il ne partage pas vos données personnelles avec des tiers, sauf dans le cas suivant :",
		"legal-obligations": "- Obligations légales",
		"legal-obligations-description": ": Il peut être tenu de divulguer vos informations si la loi l'exige.",
		"data-security": "Sécurité de vos données",
		"data-security-description": "Vous avez le droit d'accéder à vos données personnelles, de les rectifier, de les supprimer, de vous opposer au traitement ou de demander leur portabilité. Pour exercer ces droits ou poser des questions sur sa politique de protection des données, n'hésitez pas à le contacter via les coordonnées fournies sur son site.",
		"your-rights": "Vos droits",
		"your-rights-description": "Vous avez le droit d'accéder à vos données personnelles, de les rectifier, de les supprimer, de vous opposer au traitement ou de demander leur portabilité. Pour exercer ces droits ou poser des questions sur ma politique de protection des données, n'hésitez pas à me contacter via les coordonnées fournies sur mon site.",
		"policy-changes": "Modifications de la politique",
		"policy-changes-description": "Il se réserve le droit de mettre à jour cette politique de protection des données à tout moment pour refléter les changements apportés à ses pratiques ou aux exigences légales. Je vous encourage à consulter régulièrement cette page pour rester informé(e) sur la manière dont il protège vos données."
	},

	"Footer": {
		"home": "Accueil",
		"skills": "Compétences",
		"projects": "Projets",
		"experiences": "Expériences",
		"contact": "Contact",
		"legal-notices": "Mentions légales",
		"data-protection": "Protection des données",
		"about": "À PROPOS",
		"location": "Localisation",
		"download-cv": "Télécharger le CV",
		"all-rights-reserved": "Tous droits réservés"
	},

	"NotFoundPage": {
		"not-found": "Page introuvable !",
		"hey-im-devobot": "Salut, C'est Devobot !",
		"you-are-lost": "Il semblerait que vous vous soyez égaré dans un univers parallèle ! Cliquez sur le bouton ci-dessous pour revenir dans un univers connu.",
		"back": "Retour à l'accueil"
	},

	"Chart": {
		"notions": "Notions",
		"intermediate": "Intermédiaire",
		"advanced": "Avancé",
		"expert": "Expert"
	}
}
